Good afternoon! Thank you for providing detailed description!
We tested this with the latest version of the provider and it seems that this error no longer occurs. 
Example manifest:
```
resource "sbercloud_vpc" "issue-332" {
  name = "issue-332-vpc"
  cidr = "10.0.0.0/22"
}
resource "sbercloud_vpc_subnet" "issue-332" {
  cidr          = "10.0.0.0/24" //change this to "10.0.1.0/24"
  gateway_ip    = "10.0.0.1"    //and also this to "10.0.1.1/24"
  name          = "issue-332-k8s-staging-pods"
  primary_dns   = "4.4.4.4"
  secondary_dns = "8.8.8.8"
  vpc_id        = sbercloud_vpc.issue-332.id
}
resource "sbercloud_cce_cluster" "issue-332" {
  name      = "issue-332"
  flavor_id = "cce.s2.small"
  vpc_id    = sbercloud_vpc.issue-332.id
  subnet_id = sbercloud_vpc_subnet.issue-332.id

  masters {
    availability_zone = "ru-moscow-1a"
  }

  masters {
    availability_zone = "ru-moscow-1a"
  }

  masters {
    availability_zone = "ru-moscow-1c"
  }

  cluster_type           = "VirtualMachine"
  cluster_version        = "v1.29"
  container_network_type = "eni"
  kube_proxy_mode        = "ipvs"

  eni_subnet_id = join(",", [
    sbercloud_vpc_subnet.issue-332.ipv4_subnet_id
  ])

  service_network_cidr = "10.2.0.0/16"

  tags = {
    Key = "value"
  }
}

```
And plan output will be like this:
```
  # sbercloud_cce_cluster.issue-332 must be replaced
-/+ resource "sbercloud_cce_cluster" "issue-332" {
      ~ region                 = "ru-moscow-1" -> (known after apply)
      ~ subnet_id              = "717e409b-7692-4225-9033-9c9318085c07" # forces replacement -> (known after apply) # forces replacement
      ~ support_istio          = true -> (known after apply)
        tags                   = {
            "Key" = "value"
        }
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # sbercloud_vpc_subnet.issue-332 must be replaced
-/+ resource "sbercloud_vpc_subnet" "issue-332" {
      + availability_zone = (known after apply)
      ~ cidr              = "10.0.0.0/24" -> "10.0.1.0/24" # forces replacement
      ~ dns_list          = [
          - "4.4.4.4",
          - "8.8.8.8",
        ] -> (known after apply)
      ~ gateway_ip        = "10.0.0.1" -> "10.0.1.1" # forces replacement
        # (4 unchanged attributes hidden)
    }

```
This update also requires replacement of CCE, so you can't change subnet cidr, which is used by CCE without re-creating CCE